// ========================================================================================

// Бургер-меню
// import burgerMenu from './functions/burger';
// burgerMenu();


// ========================================================================================


// Модальное окно
// import popup from './functions/popup'
// const call = new popup();


// ========================================================================================


// Табы
// import tabs from "./functions/tabs";
// tabs();



// ========================================================================================


// Файл со слайдерами
// import "./functions/sliders";


// ========================================================================================


// import validateForms from './functions/validate-forms';
// const rules1 = [...];

// const afterForm = () => {
//   console.log('Произошла отправка');
// };

// validateForms('.form-1', rules1, afterForm);



// ========================================================================================



// Спойлеры
// import spollers from "./functions/spollers";
// spollers();



// ========================================================================================



// Звёздный рейтинг 
// import formRating from "./functions/rating";
// formRating();



// ========================================================================================



// quantity
// import quantity from './functions/quantity'
// quantity();


// ========================================================================================


// Динамический адаптив
// import "./functions/dynamic-adapt";


// ========================================================================================


// Фикс фулскрин-блоков
// import './functions/fix-fullheight';


// ========================================================================================
